{
  "title": "Sour Boat Life",
  "episodes": [
    {
      "title": "Let's Learn Something New - Ep. 3: Writing 3d games with Unity and C#",
      "links": [
        "https://player.twitch.tv/?video=v131951044&!autoplay"
      ],
      "tags": [
        "Unity",
        "C#",
        "Programming",
        "Games"
      ],
      "description": "Today we had time for an extra stream, so we played with respawning our ball after it is destroyed and resetting the table position. Also took a peek at the terrain generation features just for fun.",
      "originalAirDate": "2017-03-28"
    },

    {
      "title": "Let's Learn Something New - Ep. 2: Writing 3d games with Unity and C#",
      "links": [
        "https://player.twitch.tv/?video=v131513591&!autoplay"
      ],
      "tags": [
        "Unity",
        "C#",
        "Programming",
        "Games"
      ],
      "description": "During this episode we continue working on our Labyrinth game. We take a look at our TableController and how we clamped the rotation of the table, played with some materials from the asset store and started building out the table a little more.",
      "originalAirDate": "2017-03-26"
    },

    {
      "title": "Let's Learn Something New - Ep. 1: Writing 3d games with Unity and C#",
      "links": [
        "https://player.twitch.tv/?video=v129936412&!autoplay"
      ],
      "tags": [
        "Unity",
        "C#",
        "Programming",
        "Games"
      ],
      "description": "I'm starting off a new series of videos today where we start learning to program video games with the Unity engine. End objective: write an over sized 2 player labyrinth ball rolling game for VR that works for both a seated and room scale experience. In the end, I want it to look like you're rolling a bowling ball around in VR. Let's see how far we can get!",
      "originalAirDate": "2017-03-19"
    },

    {
      "title": "SourBoatJavascript: Last show dicking around with javascript and our fake shell.",
      "links": [
        "https://player.twitch.tv/?video=v123518355&!autoplay"
      ],
      "tags": [
        "Javascript",
        "web",
        "Programming",
        "Screeps"
      ],
      "description": "Let's be honest, I think we've beat this idea to death and it's getting a little boring. It was funny for a bit, but honestly, a fully functioning shell is a lot of work! Too much work for a joke to be honest. So, this is our last time dicking with this and we'll move on to probably playing with Unity next time! Also! We show off a little bit of screeps!",
      "originalAirDate": "2017-02-20"
    },
    {
      "title": "SourBoatJavascript: More meager progress on writing our fake shell on the website (again).",
      "links": [
        "https://player.twitch.tv/?video=v118415564&!autoplay",
        "https://player.twitch.tv/?video=v118416117&!autoplay"
      ],
      "tags": [
        "Javascript",
        "web",
        "Bob Ross",
        "Programming"
      ],
      "description": "Well, we're still at it. In this episode, we started really parsing path strings and we now have a data model to build our commands on. BUT, before that, we talked about happy little trees and eventually got around to BEATING THE DEVIL OUT OF IT.",
      "originalAirDate": "2017-01-28"
    },
    {
      "title": "SourBoatJavascript: More meager progress on writing our fake shell on the website.",
      "links": [
        "https://player.twitch.tv/?video=v116781185&!autoplay"
      ],
      "tags": [
        "Javascript",
        "web",
        "Plan9",
        "Programming"
      ],
      "description": "We spend a good deal of time messing around tonight, but we DID actually alter text in a new fangled fancy Eye Dee Eee in a manner congruous with the gesticulations and arcane rites of a Technomancer!",
      "originalAirDate": "2017-01-22"
    },
    {
      "title": "SourBoatJavascript: Adding a fake terminal to the web page, because mice are for pansies!",
      "links": [
        "https://www.youtube.com/embed/GttR3mkFQ60",
        "https://www.youtube.com/embed/-j-4_r_Azq8"
      ],
      "tags": [
        "Agile Development",
        "Testing"
      ],
      "description": "In this episode we were SUPPOSED to be working on writing our fake terminal to browse the videos on the site, but instead we rant about agile programming and, you know what? I forget what all we ranted about. No programming here though!",
      "originalAirDate": "2017-01-08"
    },
    {
      "title": "SourBoatWebPages: Base page almost finished! Starting a new fun project",
      "links": [
        "https://www.youtube.com/embed/oJViSkk0_lQ",
        "https://www.youtube.com/embed/Ta7SJfaMph0",
        "https://www.youtube.com/embed/X39x2S0mWJs"
      ],
      "tags": [
        "Programming",
        "CSS",
        "web",
        "Javscript"
      ],
      "description": "We have pretty much wrapped up our basic show website now. There are many more useful things we could add to this, of course, but instead, we are starting a new project that is just for shits and grins!",
      "originalAirDate": "2016-12-17"
    },
    {
      "title": "SourBoatWebPages: Better document structure, worse css + a source for real data",
      "links": [
        "https://www.youtube.com/embed/JLtTBiATNXA",
        "https://www.youtube.com/embed/HPdNcK3wXWI",
        "https://www.youtube.com/embed/bL1xO7MSYSM"
      ],
      "tags": [
        "Programming",
        "CSS",
        "JSON",
        "Liquibase",
        "Accessibility"
      ],
      "description": "We finally decide on a document structure and start styling it. It is super ugly. We also put in an easy hack to store our show data for the page (like this description)!",
      "originalAirDate": "2016-12-11"
    },
    {
      "title": "SourBoatWebPages: UI Frameworks and Databases today",
      "links": [
        "https://www.youtube.com/embed/AZc0QiGdzl8",
        "https://www.youtube.com/embed/t5IYkoQ-2hY"
      ],
      "tags": [
        "Programming",
        "UI Frameworks"
      ],
      "description": "Today we attempt to talk about web ui frameworks and databases but get sidetracked by The Hobbit and Technical Difficulties (tm).",
      "originalAirDate": "2016-12-03"
    },
    {
      "title": "Sour Boat Life: In The Beginning",
      "links": [
        "https://www.youtube.com/embed/lsLs1sQhubc"
      ],
      "tags": [
        "Programming",
        "Pilot"
      ],
      "description": "This is the first recorded episode of Dan and I messing around writing software and generally just mouthing off. In general, we'll be experimenting with new technologies and playing around with whatever interests us while we pretend to be professionals that know what we're talking about. First, we have to write a web page for this show though!",
      "originalAirDate": "2016-11-30"
    }
  ]
}
